app/controllers/school_classes_controller.rb

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 13], ["updated_at", "2020-12-18 16:13:18.167613"], ["id", 1]]